performance/k6/results/login-console.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: performance/k6/login-load-test.js
        output: -

     scenarios: (100.00%) 1 scenario, 10 max VUs, 1m30s max duration (incl. graceful stop):
              * default: Up to 10 looping VUs for 1m0s over 3 stages (gracefulRampDown: 30s, gracefulStop: 30s)


running (0m01.0s), 01/10 VUs, 0 complete and 0 interrupted iterations
default   [   2% ] 01/10 VUs  0m01.0s/1m00.0s

running (0m02.0s), 01/10 VUs, 1 complete and 0 interrupted iterations
default   [   3% ] 01/10 VUs  0m02.0s/1m00.0s

running (0m03.0s), 02/10 VUs, 2 complete and 0 interrupted iterations
default   [   5% ] 02/10 VUs  0m03.0s/1m00.0s

running (0m04.0s), 02/10 VUs, 4 complete and 0 interrupted iterations
default   [   7% ] 02/10 VUs  0m04.0s/1m00.0s

running (0m05.0s), 03/10 VUs, 5 complete and 0 interrupted iterations
default   [   8% ] 03/10 VUs  0m05.0s/1m00.0s

running (0m06.0s), 03/10 VUs, 7 complete and 0 interrupted iterations
default   [  10% ] 03/10 VUs  0m06.0s/1m00.0s

running (0m07.0s), 04/10 VUs, 9 complete and 0 interrupted iterations
default   [  12% ] 04/10 VUs  0m07.0s/1m00.0s

running (0m08.0s), 04/10 VUs, 12 complete and 0 interrupted iterations
default   [  13% ] 04/10 VUs  0m08.0s/1m00.0s

running (0m09.0s), 05/10 VUs, 16 complete and 0 interrupted iterations
default   [  15% ] 05/10 VUs  0m09.0s/1m00.0s

running (0m10.0s), 05/10 VUs, 19 complete and 0 interrupted iterations
default   [  17% ] 05/10 VUs  0m10.0s/1m00.0s

running (0m11.0s), 05/10 VUs, 23 complete and 0 interrupted iterations
default   [  18% ] 05/10 VUs  0m11.0s/1m00.0s

running (0m12.0s), 06/10 VUs, 28 complete and 0 interrupted iterations
default   [  20% ] 06/10 VUs  0m12.0s/1m00.0s

running (0m13.0s), 06/10 VUs, 33 complete and 0 interrupted iterations
default   [  22% ] 06/10 VUs  0m13.0s/1m00.0s

running (0m14.0s), 07/10 VUs, 37 complete and 0 interrupted iterations
default   [  23% ] 07/10 VUs  0m14.0s/1m00.0s

running (0m15.0s), 07/10 VUs, 43 complete and 0 interrupted iterations
default   [  25% ] 07/10 VUs  0m15.0s/1m00.0s

running (0m16.0s), 08/10 VUs, 49 complete and 0 interrupted iterations
default   [  27% ] 08/10 VUs  0m16.0s/1m00.0s

running (0m17.0s), 08/10 VUs, 53 complete and 0 interrupted iterations
default   [  28% ] 08/10 VUs  0m17.0s/1m00.0s

running (0m18.0s), 09/10 VUs, 58 complete and 0 interrupted iterations
default   [  30% ] 09/10 VUs  0m18.0s/1m00.0s

running (0m19.0s), 09/10 VUs, 61 complete and 0 interrupted iterations
default   [  32% ] 09/10 VUs  0m19.0s/1m00.0s

running (0m20.0s), 09/10 VUs, 69 complete and 0 interrupted iterations
default   [  33% ] 09/10 VUs  0m20.0s/1m00.0s

running (0m21.0s), 10/10 VUs, 75 complete and 0 interrupted iterations
default   [  35% ] 10/10 VUs  0m21.0s/1m00.0s

running (0m22.0s), 10/10 VUs, 79 complete and 0 interrupted iterations
default   [  37% ] 10/10 VUs  0m22.0s/1m00.0s

running (0m23.0s), 10/10 VUs, 88 complete and 0 interrupted iterations
default   [  38% ] 10/10 VUs  0m23.0s/1m00.0s

running (0m24.0s), 10/10 VUs, 98 complete and 0 interrupted iterations
default   [  40% ] 10/10 VUs  0m24.0s/1m00.0s

running (0m25.0s), 10/10 VUs, 99 complete and 0 interrupted iterations
default   [  42% ] 10/10 VUs  0m25.0s/1m00.0s

running (0m26.0s), 10/10 VUs, 109 complete and 0 interrupted iterations
default   [  43% ] 10/10 VUs  0m26.0s/1m00.0s

running (0m27.0s), 10/10 VUs, 119 complete and 0 interrupted iterations
default   [  45% ] 10/10 VUs  0m27.0s/1m00.0s

running (0m28.0s), 10/10 VUs, 128 complete and 0 interrupted iterations
default   [  47% ] 10/10 VUs  0m28.0s/1m00.0s

running (0m29.0s), 10/10 VUs, 135 complete and 0 interrupted iterations
default   [  48% ] 10/10 VUs  0m29.0s/1m00.0s

running (0m30.0s), 10/10 VUs, 139 complete and 0 interrupted iterations
default   [  50% ] 10/10 VUs  0m30.0s/1m00.0s

running (0m31.0s), 10/10 VUs, 149 complete and 0 interrupted iterations
default   [  52% ] 10/10 VUs  0m31.0s/1m00.0s

running (0m32.0s), 10/10 VUs, 159 complete and 0 interrupted iterations
default   [  53% ] 10/10 VUs  0m32.0s/1m00.0s

running (0m33.0s), 10/10 VUs, 168 complete and 0 interrupted iterations
default   [  55% ] 10/10 VUs  0m33.0s/1m00.0s

running (0m34.0s), 10/10 VUs, 176 complete and 0 interrupted iterations
default   [  57% ] 10/10 VUs  0m34.0s/1m00.0s

running (0m35.0s), 10/10 VUs, 179 complete and 0 interrupted iterations
default   [  58% ] 10/10 VUs  0m35.0s/1m00.0s

running (0m36.0s), 10/10 VUs, 189 complete and 0 interrupted iterations
default   [  60% ] 10/10 VUs  0m36.0s/1m00.0s

running (0m37.0s), 10/10 VUs, 199 complete and 0 interrupted iterations
default   [  62% ] 10/10 VUs  0m37.0s/1m00.0s

running (0m38.0s), 10/10 VUs, 209 complete and 0 interrupted iterations
default   [  63% ] 10/10 VUs  0m38.0s/1m00.0s

running (0m39.0s), 10/10 VUs, 215 complete and 0 interrupted iterations
default   [  65% ] 10/10 VUs  0m39.0s/1m00.0s

running (0m40.0s), 10/10 VUs, 219 complete and 0 interrupted iterations
default   [  67% ] 10/10 VUs  0m40.0s/1m00.0s

running (0m41.0s), 10/10 VUs, 229 complete and 0 interrupted iterations
default   [  68% ] 10/10 VUs  0m41.0s/1m00.0s

running (0m42.0s), 10/10 VUs, 239 complete and 0 interrupted iterations
default   [  70% ] 10/10 VUs  0m42.0s/1m00.0s

running (0m43.0s), 10/10 VUs, 249 complete and 0 interrupted iterations
default   [  72% ] 10/10 VUs  0m43.0s/1m00.0s

running (0m44.0s), 10/10 VUs, 257 complete and 0 interrupted iterations
default   [  73% ] 10/10 VUs  0m44.0s/1m00.0s

running (0m45.0s), 10/10 VUs, 262 complete and 0 interrupted iterations
default   [  75% ] 10/10 VUs  0m45.0s/1m00.0s

running (0m46.0s), 10/10 VUs, 269 complete and 0 interrupted iterations
default   [  77% ] 10/10 VUs  0m46.0s/1m00.0s

running (0m47.0s), 10/10 VUs, 279 complete and 0 interrupted iterations
default   [  78% ] 10/10 VUs  0m47.0s/1m00.0s

running (0m48.0s), 10/10 VUs, 288 complete and 0 interrupted iterations
default   [  80% ] 10/10 VUs  0m48.0s/1m00.0s

running (0m49.0s), 10/10 VUs, 297 complete and 0 interrupted iterations
default   [  82% ] 10/10 VUs  0m49.0s/1m00.0s

running (0m50.0s), 10/10 VUs, 302 complete and 0 interrupted iterations
default   [  83% ] 10/10 VUs  0m50.0s/1m00.0s

running (0m51.0s), 10/10 VUs, 309 complete and 0 interrupted iterations
default   [  85% ] 10/10 VUs  0m51.0s/1m00.0s

running (0m52.0s), 09/10 VUs, 319 complete and 0 interrupted iterations
default   [  87% ] 09/10 VUs  0m52.0s/1m00.0s

running (0m53.0s), 08/10 VUs, 328 complete and 0 interrupted iterations
default   [  88% ] 08/10 VUs  0m53.0s/1m00.0s

running (0m54.0s), 07/10 VUs, 334 complete and 0 interrupted iterations
default   [  90% ] 07/10 VUs  0m54.0s/1m00.0s

running (0m55.0s), 06/10 VUs, 340 complete and 0 interrupted iterations
default   [  92% ] 06/10 VUs  0m55.0s/1m00.0s

running (0m56.0s), 05/10 VUs, 342 complete and 0 interrupted iterations
default   [  93% ] 05/10 VUs  0m56.0s/1m00.0s

running (0m57.0s), 04/10 VUs, 347 complete and 0 interrupted iterations
default   [  95% ] 04/10 VUs  0m57.0s/1m00.0s

running (0m58.0s), 03/10 VUs, 351 complete and 0 interrupted iterations
default   [  97% ] 03/10 VUs  0m58.0s/1m00.0s

running (0m59.0s), 02/10 VUs, 354 complete and 0 interrupted iterations
default   [  98% ] 02/10 VUs  0m59.0s/1m00.0s

running (1m00.0s), 01/10 VUs, 356 complete and 0 interrupted iterations
default   [ 100% ] 01/10 VUs  1m00.0s/1m00.0s

running (1m01.0s), 01/10 VUs, 356 complete and 0 interrupted iterations
default ↓ [ 100% ] 01/10 VUs  1m0s


  █ THRESHOLDS 

    http_req_duration
    ✓ 'p(95)<800' p(95)=571.36ms

    http_req_failed
    ✓ 'rate<0.01' rate=0.00%

    login_errors
    ✓ 'rate<0.01' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 1071    17.561951/s
    checks_succeeded...: 100.00% 1071 out of 1071
    checks_failed......: 0.00%   0 out of 1071

    ✓ status es 200
    ✓ respuesta confirma login exitoso
    ✓ responde en menos de 1s

    CUSTOM
    login_duration.................: avg=277.11ms min=186.65ms med=234.54ms max=930.16ms p(90)=405.2ms p(95)=571.36ms
    login_errors...................: 0.00%  0 out of 357

    HTTP
    http_req_duration..............: avg=277.11ms min=186.65ms med=234.54ms max=930.16ms p(90)=405.2ms p(95)=571.36ms
      { expected_response:true }...: avg=277.11ms min=186.65ms med=234.54ms max=930.16ms p(90)=405.2ms p(95)=571.36ms
    http_req_failed................: 0.00%  0 out of 357
    http_reqs......................: 357    5.853984/s

    EXECUTION
    iteration_duration.............: avg=1.28s    min=1.19s    med=1.23s    max=1.99s    p(90)=1.43s   p(95)=1.57s   
    iterations.....................: 357    5.853984/s
    vus............................: 1      min=1        max=10
    vus_max........................: 10     min=10       max=10

    NETWORK
    data_received..................: 257 kB 4.2 kB/s
    data_sent......................: 64 kB  1.0 kB/s



running (1m01.0s), 00/10 VUs, 357 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/10 VUs  1m0s